{
  "backend/main.mo": "Motoko actor storing lead forms in a map with submit and query functions.",
  "feature_evidence.json": "Feature evidence report linking the phone-number update feature to affected files and components.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for all frontend source files.",
  "frontend/DEPLOYED_MAINNET.md": "Template for recording mainnet deployment details including URLs and canister IDs.",
  "frontend/DEPLOYMENT.md": "Deployment guide explaining domain rules and how to deploy to IC mainnet using free hosting.",
  "frontend/index.css": "Global Tailwind CSS setup defining color tokens and light/dark theme variables.",
  "frontend/index.html": "Frontend HTML entry point with metadata, fonts, and root mount element.",
  "frontend/project-domain.json": "JSON file defining the required project domain techmarket-digital.",
  "frontend/scripts/deploy-mainnet.sh": "Shell script validating domain and deploying frontend/back-end canisters to IC mainnet.",
  "frontend/scripts/post-deploy-smoke-check.md": "Checklist for verifying core features and behavior after mainnet deployment.",
  "frontend/src/App.tsx": "Root React component applying theme provider and rendering HomePage and Toaster.",
  "frontend/src/components/landing/Footer.tsx": "Footer component showing brand text, navigation buttons, and social links using siteConfig.",
  "frontend/src/components/landing/Header.tsx": "Responsive header with brand display, navigation links, CTA buttons, and a toggleable mobile menu.",
  "frontend/src/components/landing/LeadForm.tsx": "Lead capture form with validation, submit handling, success state, and integration with useLeadForm hook.",
  "frontend/src/components/landing/Motion.tsx": "Wrapper component that reveals children with a visibility animation using IntersectionObserver and optional delay.",
  "frontend/src/components/landing/ProcessSteps.tsx": "Displays a four-step animated process grid using MotionDiv and icon cards.",
  "frontend/src/components/landing/Sections.tsx": "Defines major landing page sections such as hero, trust, services, process, and contact using copy and animations.",
  "frontend/src/components/landing/ServicesGrid.tsx": "Renders an animated grid of service cards with icons and descriptions.",
  "frontend/src/components/landing/StickyContactButtons.tsx": "Fixed-position WhatsApp and call buttons for quick user contact, with mobile-specific adjustments.",
  "frontend/src/config/contact.ts": "Centralized contact config providing numbers, labels, and computed WhatsApp and phone URLs.",
  "frontend/src/config/siteConfig.ts": "Global site configuration including branding, SEO, CTA labels, social links, and form copy.",
  "frontend/src/content/homeCopy.ts": "Text content for homepage sections, sourcing CTA labels from siteConfig.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on authentication, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, handling login state, stored identities, and status flags.",
  "frontend/src/hooks/useLeadForm.ts": "Implements form state, validation, and submission logic for sending lead data to a backend actor, including success/error handling.",
  "frontend/src/index.css": "Defines Tailwind CSS base styles, custom OKLCH color variables, dark mode themes, typography, and motion utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the Internet Identity provider before rendering.",
  "frontend/src/pages/HomePage.tsx": "Assembles the landing page layout by composing various section components, header, footer, and sticky contact buttons.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, animations, container settings, extended theme options, and plugins.",
  "frontend/WEBSITE_EDITING_GUIDE.md": "Guide showing which config files control editable website content and branding.",
  "project_state.json": "Tracks project metadata, known issues, and feature requests related to updating and centralizing the site's phone number."
}