{
  "backend/main.mo": "Motoko actor storing lead forms in a map with functions to submit and retrieve leads.",
  "feature_evidence.json": "Feature evidence report listing domain configuration and deployment-related files, components, and tests.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all major frontend source files and configuration documents.",
  "frontend/DEPLOYED_MAINNET.md": "Template for recording live IC mainnet deployment details including domain, URL, and canister IDs.",
  "frontend/DEPLOYMENT.md": "Deployment guide explaining domain rules, requirements, and steps for deploying to IC mainnet.",
  "frontend/index.css": "Global Tailwind-based styling defining OKLCH color tokens and light/dark theme variables.",
  "frontend/index.html": "HTML entry point with SEO metadata, font preloads, and root mount for the React app.",
  "frontend/project-domain.json": "JSON file setting the required project domain to \"techmarket-digital\".",
  "frontend/scripts/deploy-mainnet.sh": "Mainnet deployment script validating domain, building frontend, and deploying canisters.",
  "frontend/scripts/post-deploy-smoke-check.md": "Checklist for verifying a successful mainnet deployment, covering UI, links, responsiveness, and backend behavior.",
  "frontend/src/App.tsx": "React root component wrapping HomePage with theme support and notification toaster.",
  "frontend/src/components/landing/Footer.tsx": "Renders the landing page footer with brand info, quick navigation buttons, and social links.",
  "frontend/src/components/landing/Header.tsx": "Implements a sticky header with logo, navigation links, CTAs, and a mobile menu toggle.",
  "frontend/src/components/landing/LeadForm.tsx": "Provides a lead capture form with validation, submission handling, and a success state.",
  "frontend/src/components/landing/Motion.tsx": "Adds intersection-based reveal animations to wrapped elements with optional delay.",
  "frontend/src/components/landing/ProcessSteps.tsx": "Displays a four-step marketing process using animated cards and icons.",
  "frontend/src/components/landing/Sections.tsx": "Defines major landing sections like hero, trust, and others using animated content and CTAs.",
  "frontend/src/components/landing/ServicesGrid.tsx": "Shows a grid of service offerings with icons, descriptions, and motion effects.",
  "frontend/src/components/landing/StickyContactButtons.tsx": "Renders floating WhatsApp and call buttons for quick contact access.",
  "frontend/src/config/contact.ts": "Stores contact numbers and generates WhatsApp and phone URLs.",
  "frontend/src/content/homeCopy.ts": "Provides copy text for landing sections like hero, services, trust, and CTAs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s Internet Identity and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and state tracking for authentication status.",
  "frontend/src/hooks/useLeadForm.ts": "Manages lead form state, validation, submission via backend actor, and success/error UI handling.",
  "frontend/src/index.css": "Defines Tailwind base styles, custom color variables, typography, dark mode theming, and motion utility classes.",
  "frontend/src/main.tsx": "Bootstraps the app with React, wrapping it in React Query and Internet Identity providers.",
  "frontend/src/pages/HomePage.tsx": "Assembles the homepage layout by rendering all landing sections and sticky contact components.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, custom colors, animations, typography, and plugins for the project.",
  "project_state.json": "Stores project metadata, requirements, architectural notes, and implemented feature tracking."
}